fun main(){
    //1. Измените программу с переменными welcome и place так, чтобы на экран выводилась строка "Hello World!", а не "HelloWorld". Значения переменных менять нельзя.
    //val welcome="Hello"
    //var place= readLine()
    //println(welcome+" "+place+"!")

    //2. Напишите программу, в которой тело функции main() состоит всего из одной строки-выражения, в котором с ввода запрашиваются две строки, соединяются в одну и выводятся на экран.
    //println(readLine()+" "+ readLine())

    //3. Присвойте двум переменным числа, выведите на экран их сумму. Проверьте, допустимо ли в Kotlin складывать строку и число.
    var one=1
    var two="2"
    println(two+one)
}